AVARTS/CFU_NPL_220528/CFU_NPL_220526a/000_ScenePlan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-26 Thu 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SCENE PLAN AND INSTRUCTIONS</title>
<meta name="author" content="Iannis Zannos" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">SCENE PLAN AND INSTRUCTIONS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf04ed73">1. Performers names</a>
<ul>
<li><a href="#org9eed163">1.1. Corfu</a></li>
<li><a href="#org2f855ef">1.2. Nafplion</a></li>
</ul>
</li>
<li><a href="#orgc838c82">2. Sensor Allocation</a>
<ul>
<li><a href="#org3e5c1a7">2.1. Sensor allocation for Corfu</a></li>
<li><a href="#orga02531b">2.2. Sensor allocation for Nafplion:</a></li>
</ul>
</li>
<li><a href="#org36e4ebe">3. Scene 1: 3 Dialogs (10 minutes)</a></li>
<li><a href="#org2a94cf9">4. Scene 2: 2 Rhythms (7 minutes)</a>
<ul>
<li><a href="#org9cc1ad1">4.1. Scene 2, Part 1 sounds</a></li>
<li><a href="#orgab076db">4.2. Scene 2, Part 2 sensors and sounds:</a></li>
</ul>
</li>
<li><a href="#org90c21e8">5. Scene 3: Duel (10 minutes!)</a>
<ul>
<li><a href="#org2ed6ee7">5.1. Introductory early notes</a></li>
<li><a href="#org920051b">5.2. Scene parts</a></li>
</ul>
</li>
<li><a href="#orgde4285f">6. Scene 4</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf04ed73" class="outline-2">
<h2 id="orgf04ed73"><span class="section-number-2">1.</span> Performers names</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9eed163" class="outline-3">
<h3 id="org9eed163"><span class="section-number-3">1.1.</span> Corfu</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1. Elli Lymperopoulou</td>
<td class="org-left">Ελλη Λυμπεροπούλου</td>
</tr>

<tr>
<td class="org-left">2. Niki  Matzona</td>
<td class="org-left">Νική Ματζώνα</td>
</tr>

<tr>
<td class="org-left">3. Xenia Kitzoglou</td>
<td class="org-left">Ξένια Κιτζόγλου</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2f855ef" class="outline-3">
<h3 id="org2f855ef"><span class="section-number-3">1.2.</span> Nafplion</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Φοίβος-Θεοδόσιος Μεμελετζόγλου</li>
<li>Μαρίνα Παπασταμάτη</li>
<li>Βιργινία-Μέλια Στογιαννίδου</li>
<li>Στεφανία Συμεωνίδου</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc838c82" class="outline-2">
<h2 id="orgc838c82"><span class="section-number-2">2.</span> Sensor Allocation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3e5c1a7" class="outline-3">
<h3 id="org3e5c1a7"><span class="section-number-3">2.1.</span> Sensor allocation for Corfu</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Niki: 1, 2
Xenia: 3, 4
</p>
</div>
</div>

<div id="outline-container-orga02531b" class="outline-3">
<h3 id="orga02531b"><span class="section-number-3">2.2.</span> Sensor allocation for Nafplion:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Elli - in part 1: 5, 6
</p>

<p>
Foivos: 5
Virginia: 6
Marina: 7  // Elli in part 2: sensor 7
Stefania: 8
</p>

<p>
Elli in part 3: 5, 6
</p>
</div>
</div>
</div>


<div id="outline-container-org36e4ebe" class="outline-2">
<h2 id="org36e4ebe"><span class="section-number-2">3.</span> Scene 1: 3 Dialogs (10 minutes)</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Dialog name</td>
<td class="org-left">Instruction</td>
<td class="org-left">CFU performer</td>
<td class="org-left">CFU sounds</td>
<td class="org-left">CFU sensors</td>
<td class="org-left">NPL performer</td>
<td class="org-left">NPL Sounds</td>
<td class="org-left">NPL sensors</td>
</tr>

<tr>
<td class="org-left">Dialog 1 3&rsquo;</td>
<td class="org-left">Dialog Cameras Off</td>
<td class="org-left">Niki</td>
<td class="org-left">Glass</td>
<td class="org-left">3, 4</td>
<td class="org-left">Elli</td>
<td class="org-left">Shepard</td>
<td class="org-left">5, 6</td>
</tr>

<tr>
<td class="org-left">Dialog 2 3&rsquo;</td>
<td class="org-left">Speed dialog Cameras On</td>
<td class="org-left">Niki</td>
<td class="org-left">Gun</td>
<td class="org-left">3, 4</td>
<td class="org-left">Virginia</td>
<td class="org-left">Glass</td>
<td class="org-left">(5, 6?) 7, 8!</td>
</tr>

<tr>
<td class="org-left">Dialog 3 3&rsquo;</td>
<td class="org-left">Level dialog Cameras On</td>
<td class="org-left">Niki</td>
<td class="org-left">StandardL</td>
<td class="org-left">3, 4</td>
<td class="org-left">Stefania</td>
<td class="org-left">Glass</td>
<td class="org-left">5, 6</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2a94cf9" class="outline-2">
<h2 id="org2a94cf9"><span class="section-number-2">4.</span> Scene 2: 2 Rhythms (7 minutes)</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Part</td>
<td class="org-left">Duratrion</td>
<td class="org-left">Corfu</td>
<td class="org-left">Navplion</td>
</tr>

<tr>
<td class="org-left">Part 1</td>
<td class="org-left">3:30&rsquo;</td>
<td class="org-left">Improv</td>
<td class="org-left">Rhythm</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Virginia, Stefania, Foivos, Marina <i>/ Corfu /</i> -Marina-Stefania / -Foivos -Virginia</td>
</tr>

<tr>
<td class="org-left">Part 2</td>
<td class="org-left">5&rsquo;</td>
<td class="org-left">Rhythm</td>
<td class="org-left">Improv duets: Virginia, Foivos (Iannis) and Elli, Stefania (Takumi)</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org9cc1ad1" class="outline-3">
<h3 id="org9cc1ad1"><span class="section-number-3">4.1.</span> Scene 2, Part 1 sounds</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Navplion: Simple rhythm pattern with simple sine tones.</li>
<li>Corfu: Improvisaiont with simple sine tones (or partly later also more complex sounds?)</li>
</ul>
</div>
</div>

<div id="outline-container-orgab076db" class="outline-3">
<h3 id="orgab076db"><span class="section-number-3">4.2.</span> Scene 2, Part 2 sensors and sounds:</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Corfu: Simple rhythm pattern with simple sine tones.</li>
<li>Navplion: Improvisation duets as follows:
<ul class="org-ul">
<li>Virginia sensor 6, Foivos sensor 5: Iannis Zannos fixed sounds (as rehearsed till now).</li>
<li>Elli sensor 7, Stefania sensor 8: Takumi Ikeda free live coding sounds.</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org90c21e8" class="outline-2">
<h2 id="org90c21e8"><span class="section-number-2">5.</span> Scene 3: Duel (10 minutes!)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org2ed6ee7" class="outline-3">
<h3 id="org2ed6ee7"><span class="section-number-3">5.1.</span> Introductory early notes</h3>
<div class="outline-text-3" id="text-5-1">
<p>
TEXT INSTRUCTIONS URGENT!!!!!!!!
</p>

<p>
Formal strategy model: Concerto Grosso. &ldquo;Tutti - Concertino i.e. Duet or Solo&rdquo;.
</p>

<p>
CHOREOGRAPHIC DIRECTION:
</p>

<p>
CFU: Hari Marini
NPL: Stella Dimitrakopoulou
</p>

<p>
Material: Single sine tones.
Method:
NPL: 4 persons, sensors 5, 6, 7, 8.  Note on - off through z parameter
CFU: Niki, Xenia, <b>Takumi Ikeda Live coding</b>.
</p>
</div>
</div>

<div id="outline-container-org920051b" class="outline-3">
<h3 id="org920051b"><span class="section-number-3">5.2.</span> Scene parts</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Sounds:
Navplion: Simple tones
Corfu: Live Coding TI.  Sensors 1, 2, 3, 4
</p>

<ol class="org-ol">
<li>2&rsquo; Virginia, Stefania : Improv from Duel (Simple tones) / Corfu: -</li>
<li>2&rsquo; Virginia, Foivos : Improv from Duel (Simple tones)   / Corfu: Enter Niki (1, 2) (p., Crescendo&#x2026;.)</li>
</ol>
<p>
2b. 2&rsquo; Virginia, Foivos : Improv from Duel (Simple tones)  / Corfu: Enter Xenia (3, 4) (more crescendo)
</p>
<ol class="org-ol">
<li>2&rsquo; Foivos, Marina: Improv from Duel (Simple tones)      / Corfu: Niki and Xenia (1, 2, 3, 4) CLIMAX!</li>
</ol>
<p>
3b. 2&rsquo; Foivos, Marina: Simple tones                        / Corfu: Exit Niki (diminuendo)
</p>
<ol class="org-ol">
<li>Virginia, Stefania, Marina                              / Corfu: Exit Xenia (diminuendo)</li>
<li>Virginia, Stefania, Marina, Foivos                      / Corfu: -</li>
</ol>

<p>
<code>==========================================</code>
<code>==</code> pause, transition to last section <code>===</code>
</p>

<p>
Sensors 5, 6 -&gt; Elli.
</p>
</div>
</div>
</div>

<div id="outline-container-orgde4285f" class="outline-2">
<h2 id="orgde4285f"><span class="section-number-2">6.</span> Scene 4</h2>
<div class="outline-text-2" id="text-6">
<p>
Solo with Elli and Live coding with Takumi Ikeda
Finally:
Invitation to audience: Extra participation by workshop audience.
Optional: Also CFU: Niki, Xenia.
</p>

<p>
Sensors:
</p>
<ol class="org-ol">
<li>Elli: 5, 6,  5 minutes</li>
<li>Audience: 7, 8  5 minutes</li>
</ol>

<p>
Optional for part B. :
CFU: 1, 2, 3, 4.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Iannis Zannos</p>
<p class="date">Created: 2022-05-26 Thu 16:39</p>
</div>
</body>
</html>
